<a href="https://colab.research.google.com/github/nickpittman/In-Class-Labs/blob/main/9_7_In_Class_Lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Nick Pittman</b><br>
Date: Septemeber 7, 2021
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

In [ ]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/Datasets/titanic.csv")
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [ ]:
# what are the features (column titles) of the titanic dataset?
titanic.columns
#len(titanic.columns) #number of columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
#display columns
titanic['pclass'] #better for columns with space in name
#or
titanic.pclass

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

In [ ]:
# display only the 'embark_town' column of the titanic data
titanic.embark_town

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [ ]:
# type of a column
type(titanic['embark_town'])

pandas.core.series.Series

In [ ]:
#subset multiple colimns
subset = titanic[['pclass', 'age', 'survived']]
subset

     pclass   age  survived
0         3  22.0         0
1         1  38.0         1
2         3  26.0         1
3         1  35.0         1
4         3  35.0         0
..      ...   ...       ...
886       2  27.0         0
887       1  19.0         1
888       3   NaN         0
889       1  26.0         1
890       3  32.0         0

[891 rows x 3 columns]

In [ ]:
# what is the "shape" of the data frame? Number of elements in each dimension
titanic.shape[1] #columns
titanic.shape[0] #rows

891

In [ ]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows

subset = titanic.loc[871:890]
subset

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
873         0       3    male  47.0  ...   NaN  Southampton     no   True
874         1       2  female  28.0  ...   NaN    Cherbourg    yes  False
875         1       3  female  15.0  ...   NaN    Cherbourg    yes   True
876         0       3    male  20.0  ...   NaN  Southampton     no   True
877         0       3    male  19.0  ...   NaN  Southampton     no   True
878         0       3    male   NaN  ...   NaN  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
881         0       3    male  33.0  ...   NaN  Southampton     no   True
882         0       3  female  22.0  ...   NaN  Southampton     no   True
883         0       2    male  28.0  ...   NaN  Southampton     no   True
884         0       3    male  25.0  ...   NaN  Southampton     no   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[20 rows x 15 columns]

In [ ]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subest dataframe

titanic.loc[890]; #treats 890 as a "name", not a number
titanic.iloc[890]; #treats 890 as a index number uding iLoc

subset = titanic.loc[880:885]

subset.loc[880] #works
subset.iloc[0] #treats subset as new array, must use new positioning to access data points

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

loc : used with labels <br>
iloc : used with indices

In [ ]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

queenstown_subset = titanic[ titanic['embark_town'] == 'Queenstown'] 
queenstown_subset

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
32          1       3  female   NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
790         0       3    male   NaN  ...   NaN   Queenstown     no   True
825         0       3    male   NaN  ...   NaN   Queenstown     no   True
828         1       3    male   NaN  ...   NaN   Queenstown    yes   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

In [ ]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape[0]

77

In [ ]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [ ]:
# what is the average age for all of those in the queenstown_subset?
queenstown_subset['age'].mean();
# do all of the passengers have an age recorded? What is recorded if there is no age?
# NaN is recorded if there is no age
queenstown_subset['age'].unique()

array([ nan,  2. , 15. , 19. , 70.5, 16. ,  4. , 40. , 44. ,  7. , 65. ,
       22. , 30. , 33. , 21. , 29. , 40.5, 57. , 18. , 32. , 25. , 31. ,
       30.5,  8. , 39. ])

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

__unique()__: shows all the difference values in the dataframe, works for indices and strings <br>
__mean()__: shows the average numerical value <br>
__isnull()__: returns a boolean for if the values in the dataframe are null or not <br>
__fillna()__: fills all null values with a provided value

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()

queenstown_subset['sex'].unique()
queenstown_subset['fare'].mean()
queenstown_subset['age'].isnull()
queenstown_subset['age'].median()

27.0

In [ ]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()

queenstown_subset['age'].fillna(0)

5       0.0
16      2.0
22     15.0
28      0.0
32      0.0
       ...
790     0.0
825     0.0
828     0.0
885    39.0
890    32.0
Name: age, Length: 77, dtype: float64

In [ ]:
# load in the iris data
iris = pandas.read_csv("/content/drive/MyDrive/Datasets/irisData.csv")

# what is the median sepal width of just the Setosas?
setosas = iris[iris['species'] == 'Iris-setosa']
setosas = setosas[['species', 'sepal width']]
setosas['sepal width'].median()

3.4

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
versicolor = iris[ (iris['species'] == 'Iris-versicolor') & (iris['petal length'] > 4.0)]
versicolor['sepal length'].mean()

6.14705882352941